#language: ru

@ExportScenarios
@tree

Функционал: Настройка НСИ. Раздел_Номенклатура

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий:_060_Наборы номенклатуры
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаРазрезыУчета'
	И я активизирую поле 'Наборы номенклатуры'
	Если флаг с именем 'ИспользоватьНаборы' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьНаборы'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_065_Характеристики номенклатуры
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаРазрезыУчета'
	И я активизирую поле 'Характеристики номенклатуры'
	Если флаг с именем 'ИспользоватьХарактеристикиНоменклатуры' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьХарактеристикиНоменклатуры'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"	

Сценарий:_070_Упаковки номенклатуры
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаРазрезыУчета'
	И я активизирую поле 'Упаковки номенклатуры'
	Если флаг с именем 'ИспользоватьУпаковкиНоменклатуры' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьУпаковкиНоменклатуры'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_075_Серии товаров
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаРазрезыУчета'
	И я активизирую поле 'Серии товаров'
	Если флаг с именем 'ИспользоватьСерииНоменклатуры' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьСерииНоменклатуры'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_080_Качество товаров
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаРазрезыУчета'
	И я активизирую поле 'Качество товаров'
	Если флаг с именем 'ИспользоватьКачествоТоваров' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьКачествоТоваров'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_085_Единицы измерения для отчетов
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаЕдиницыИзмерения'
	И я активизирую поле 'Единицы измерения для отчетов'
	Если флаг с именем 'ИспользоватьЕдиницыИзмеренияДляОтчетов' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьЕдиницыИзмеренияДляОтчетов'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_090_Контроль уникальности рабочего наименования и характеристик
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаНастройкиСоздания'
	И я активизирую поле 'Контроль уникальности рабочего наименования номенклатуры и характеристик'
	Если флаг с именем 'КонтролироватьУникальностьРабочегоНаименованияНоменклатурыИХарактеристик' равен "True" Тогда
		И я снимаю флаг с именем 'КонтролироватьУникальностьРабочегоНаименованияНоменклатурыИХарактеристик'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_095_Контроль уникальности номенклатуры и харатеристик по сочетанию значений реквизитов
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаНастройкиСоздания'
	И я активизирую поле 'Контроль уникальности номенклатуры и характеристик по сочетанию значений реквизитов'
	Если флаг с именем 'КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов' равен "True" Тогда
		И я снимаю флаг с именем 'КонтролироватьУникальностьНоменклатурыПоСочетаниюЗначенийРеквизитов'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_100_Поиск в списках товаров
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаНастройкиПоиска'
	И я меняю значение переключателя с именем 'ВариантПоиска2' на "Расширенный"
	И я закрываю окно "Номенклатура"	

Сценарий:_105_Максимальное количество элементов в дереве отборов
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаНастройкиПоиска'
	И в поле с именем 'МаксимальноеКоличествоЭлементовВДеревеОтборовНоменклатуры' я ввожу текст "50"
	И я закрываю окно "Номенклатура"

Сценарий:_110_Сертификаты номенклатуры
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаДополнительнаяИнформация'
	И я активизирую поле 'Сертификаты номенклатуры'
	Если флаг с именем 'ИспользоватьСертификатыНоменклатуры' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьСертификатыНоменклатуры'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"

Сценарий:_115_Классификаторы номенклатуры
	Когда в панели разделов я выбираю "НСИ и администрирование"
	И В панели функций в группе "Настройка НСИ и разделов" я выбираю "Номенклатура"
	И я разворачиваю группу с именем 'ГруппаДополнительнаяИнформация'
	И я активизирую поле 'Классификаторы номенклатуры'
	Если флаг с именем 'ИспользованиеКлассификаторовНоменклатуры' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользованиеКлассификаторовНоменклатуры'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Номенклатура"		