#language: ru

@ExportScenarios
@tree


Функционал: Настройка НСИ. Раздел_Предприятие

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий:_0010_Установка флага_Несколько организаций
	И В командном интерфейсе я выбираю "НСИ и администрирование" "Предприятие"
	И я активизирую поле 'Несколько организаций'
	Если флаг с именем 'ИспользоватьНесколькоОрганизаций' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьНесколькоОрганизаций'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Предприятие"
	
Сценарий:_0020_Установка флага_Раздельные операции закупок и продаж для упр и регл учета
	И В командном интерфейсе я выбираю "НСИ и администрирование" "Предприятие"
	И я активизирую поле 'Раздельные операции закупок и продаж для упр. и регл.  учета'
	Если флаг с именем 'ИспользоватьУправленческуюОрганизацию' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьУправленческуюОрганизацию'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Предприятие"

Сценарий:_0030_Представление входящих документов
	И В командном интерфейсе я выбираю "НСИ и администрирование" "Предприятие"
	И из выпадающего списка с именем 'ПредставлениеВходящихДокументов' я выбираю точное значение "Стандартное: внутреннее наименование, номер, дата"
	И я закрываю окно "Предприятие"

Сценарий:_0040_Несколько валют
	И В командном интерфейсе я выбираю "НСИ и администрирование" "Предприятие"
	И я разворачиваю группу с именем 'ГруппаНастройкиВалют'
	И я активизирую поле 'Несколько валют'
	Если флаг с именем 'ИспользоватьНесколькоВалют' равен "False" Тогда
		И я устанавливаю флаг с именем 'ИспользоватьНесколькоВалют'
		Если открылось окно "1С:Предприятие" Тогда
			И я нажимаю на кнопку с именем 'Button0'
	И я закрываю окно "Предприятие"	

Сценарий:_0050_ссылка Валюты
	И В командном интерфейсе я выбираю "НСИ и администрирование" "Предприятие"
	И я разворачиваю группу с именем 'ГруппаНастройкиВалют'
	И я нажимаю на кнопку с именем 'ОткрытьВалюты'
	И в таблице 'Валюты' я активизирую поле с именем 'Наименование'
	И Я запоминаю в переменную "Валюта" значение "RUB"
	И я запоминаю значение поля с именем 'Наименование' таблицы 'Валюты' как 'СимвКод'
	Если "$СимвКод$ <> $Валюта$" Тогда
		И в таблице 'Валюты' я активизирую поле с именем 'НаименованиеПолное'
		И в таблице "Валюты" я перехожу к строке
			| 'Наименование валюты' | 'Цифр. код' |
			| 'Российский рубль'    | '643'       |
		И в таблице 'Валюты' я выбираю текущую строку
		И в поле с именем 'Наименование' я ввожу текст "RUB"
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
	И я закрываю окно "Валюты"	
	И я закрываю окно "Предприятие"	
			
		