#language: ru

@tree

Функционал: Возврат товара от клиента с возвратом ДС

Как Аналитик я хочу
подготовить фичу по возвратам товара и ДС 
чтобы создать видео-ролик  

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Возврат товара от клиента с возвратом ДС

* Всем привет! С вами Ванесса
* И сегодня мы с вами поговорим о процедуре возврата отгруженного товара от клиента с последующим возвратом денежных средств
* Подробно разберём всю цепочку документов в информационной системе на примере
	И Пауза 1
* Первичным документом на возврат товаров является заявка на возврат
* Данный документ можно оформить на основании реализации, по которой была произведена отгрузка товаров клиенту
* Давайте в качестве примера подберём реализацию, а затем создадим документ Заявка на возврат товаров от клиента
	И Пауза 1
* Реализацию можно найти в разеле Продажи, подраздел Оптовые продажи	
	И В командном интерфейсе я выбираю "Продажи" "Документы продажи (все)"
	И в таблице 'СписокДокументыПродажи' я перехожу к строке:
		| "Автор"                    | "Валюта" | "Вид документа"                          | "Дата"       | "Клиент"                       | "Контрагент"                   | "Менеджер"                | "Номер"       | "Организация" | "Подразделение" | "Склад"         | "Состояние оригинала" | "Сторно (исправление)" | "Сумма"     |
		| "Мусина Татьяна Андреевна" | "RUB"    | "Реализация товаров и услуг, Реализация" | "20.08.2026" | "ИННОВАЦИИ МИРОВЫХ ТЕХНОЛОГИЙ" | "ИННОВАЦИИ МИРОВЫХ ТЕХНОЛОГИЙ" | "Ли Александр Эдуардович" | "LI00-000131" | "ЛИНКИ"       | "Отдел продаж"  | "Склад товаров" | "<Неизвестно>"        | "Нет"                  | "66 000,00" |
	И в таблице 'СписокДокументыПродажи' я выбираю текущую строку
	Тогда открылось окно "Реализация товаров и услуг LI00-000131 от *"

* На основании реализации оформляем документ Заявка на возврат товаров от клиента
* Для этого необходимо нажать на кнопку Создать на основании и выбрать документ Заявка на возврат товаров от клиента
	И я нажимаю на кнопку с именем 'ПодменюСоздатьНаОснованииОбычное__Авто_FAF9AAE43F3CE66A07B0D2AB129C8DE1'
	Тогда открылось окно "Заявка на возврат товаров от клиента (создание)"
* В способе компенсации необходимо указать нужный нам вариант - вернуть денежные средства
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
	| 'Имя/ID'      |
	| 'Компенсация' |
	
	| 'Имя'          | 'Значение'           |
	| 'text'         | 'Способ компенсации' |
	| 'color'        | 32768                |
	| 'transparency' | 127                  |
	| 'duration'     | 1500                 |
	| 'thickness'    | 6                    |
	| 'frameDelay'   | 20                   |
	
	И из выпадающего списка с именем 'СпособКомпенсации' я выбираю точное значение "Вернуть денежные средства"
* Внесём в документ необходимый комментарий, а также проверим что данные во вкладках Возвращаемые товары и Дополнительно внесены без ошибок
	И в поле с именем 'Комментарий' я ввожу текст "Тестовый пример"
	И Пауза 1
	И я перехожу к закладке с именем 'ГруппаВозвращаемыеТовары'
	И Пауза 1
	И я перехожу к закладке с именем 'ГруппаДополнительно'
	И Пауза 1
	И я перехожу к закладке с именем 'ГруппаОсновное'
* Запишем и проведём документ	
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	И я запоминаю значение поля с именем 'Номер' как '$НомерЗаявкиНаВозврат$'
	И Пауза 1
	И я нажимаю на кнопку с именем 'ФормаПровести'
	Тогда открылось окно "Заявка на возврат товаров от клиента $НомерЗаявкиНаВозврат$ от *"

* Итак, мы запланировали возврат товаров от клиента и необходимую компенсацию - вернуть денежные средства
* Для физического возврата товара в системе необходимо сформировать два документа - возврат товара и приходный ордер на склад
	И Пауза 1
* Документ Возврат товара от клиента формируется на основании заявки на возврат
* Для этого необходимо нажать на кнопку Создать на основании и выбрать документ Возврат товаров от клиента
	И я нажимаю на кнопку с именем 'ПодменюСоздатьНаОснованииОбычное__Авто_9ED04CEF0DFC91261A2D1509EB96FC19'

//	Когда открылось окно "1С:Предприятие"
//	И я нажимаю на кнопку с именем 'Button0'


	Тогда открылось окно "Возврат товаров от клиента (создание)"
* Все данные в документе заполняются автоматически на основании информации из заявки на возврат
* Внесем комментарий в документ, проверим данные во вкладках и проведём документ	
	И в поле с именем 'Комментарий' я ввожу текст "Тестовый пример"
	И Пауза 1
	И я перехожу к закладке с именем 'ГруппаТовары'
	И Пауза 1
	И я перехожу к закладке с именем 'ГруппаДополнительно'
	И Пауза 1
	И я перехожу к закладке с именем 'ГруппаОсновное'
	И Пауза 1
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	И я запоминаю значение поля с именем 'Номер' как '$НомерВозвратаТоваровОтКлиента$'
	Тогда открылось окно "Возврат товаров от клиента $НомерВозвратаТоваровОтКлиента$ от *"
	И я нажимаю на кнопку с именем 'ФормаПровести'

* Приходный ордер и дальнейшее адресное размещение товара оформляются сотрудниками склада
* Оформление данных документов в данном ролике мы рассматривать не будем
	И В командном интерфейсе я выбираю "Склад и доставка" "Приемка"
	Тогда открылось окно "Приемка товаров на склад"
	И в таблице 'РаспоряженияНаПоступление' я перехожу к строке:

		| "Номер"                           |
		| "$НомерВозвратаТоваровОтКлиента$" |
	И я нажимаю на кнопку с именем 'РаспоряженияНаПоступлениеСоздатьОрдер'
	Тогда открылось окно "Приходный ордер на товары (создание)"
	И из выпадающего списка с именем 'Помещение' я выбираю точное значение "Основной склад"
	И в поле с именем 'Комментарий' я ввожу текст "Тестовый пример"
	И я перехожу к закладке с именем 'ГруппаТовары'
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличествоУпаковок'
	И в таблице 'Товары' я выбираю текущую строку
	И в таблице 'Товары' в поле с именем 'ТоварыКоличествоУпаковок' я ввожу текст "2,000"
	И в таблице 'Товары' я завершаю редактирование строки
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыУпаковка'
	И в таблице 'Товары' я выбираю текущую строку
	И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыУпаковка'
	Тогда открылось окно "Выберите единицу измерения"
	И в таблице 'УпаковкиЕдиницыИзмерения' я перехожу к строке:
		| "Наименование" |
		| "шт."          |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно "Приходный ордер на товары (создание) *"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыСерия'
	И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыСерия'
	Тогда открылось окно "Регистрация серий товаров"
	И я нажимаю на кнопку с именем 'СгенерироватьНомер'
	И я нажимаю на кнопку с именем 'СгенерироватьНомер'
	И я нажимаю на кнопку с именем 'ЗавершитьВводСерий'
	Тогда открылось окно "Приходный ордер на товары (создание) *"
	И я нажимаю на кнопку с именем 'ФормаЗаписать'

	И я запоминаю значение поля с именем 'Номер' как '$НомерПриходногоОрдера$'

	Тогда открылось окно "Приходный ордер на товары $НомерПриходногоОрдера$ от *"
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И из выпадающего списка с именем 'Статус' я выбираю точное значение "В работе"
	И я нажимаю на кнопку с именем 'ФормаПровести'
	Тогда открылось окно "Приходный ордер на товары $НомерПриходногоОрдера$ от *"
	И из выпадающего списка с именем 'Статус' я выбираю точное значение "Требуется обработка"
	И я нажимаю на кнопку с именем 'ФормаПровести'
	Тогда открылось окно "Приходный ордер на товары $НомерПриходногоОрдера$ от *"
	И из выпадающего списка с именем 'Статус' я выбираю точное значение "Принят"
	И я нажимаю на кнопку с именем 'ФормаПровести'
	Тогда открылось окно "Приходный ордер на товары $НомерПриходногоОрдера$ от *"

* После приёмки товара на склад можно провести возврат денежных средств клиенту
* Для этого необходимо сформировать в системе два документа: Заявку на расходование денежных средств и Списание безналичных денежных средств
	И Пауза 1

* Заявку на расходование денежных средств можно сформировать на основании заявки на возврат товаров от клиента
	И В панели открытых я выбираю "Заявка на возврат товаров от клиента $НомерЗаявкиНаВозврат$ от *"

* Для этого необходимо нажать на кнопку Создать на основании и выбрать документ Заявка на расходование денежных средств
	И я нажимаю на кнопку с именем 'ПодменюСоздатьНаОснованииОбычное__Авто_13A25BDAA3B34DCE8D293D9E7538A708'
	Тогда открылось окно "Заявка на расходование денежных средств (создание)"
	
* В заявке заполняем необходимые поля: Дата платежа, Подразделение, статья ДДС	
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
	| 'Имя/ID'       |
	| 'Дата платежа' |
	
	| 'Имя'          | 'Значение'           |
	| 'text'         | 'Дата Платежа' |
	| 'color'        | 32768                |
	| 'transparency' | 127                  |
	| 'duration'     | 1500                 |
	| 'thickness'    | 6                    |
	| 'frameDelay'   | 20                   |
	И я нажимаю кнопку выбора у поля с именем 'ЖелательнаяДатаПлатежа'
	И в поле с именем 'ЖелательнаяДатаПлатежа' я ввожу текст "28082026"
	
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
	| 'Имя/ID'        |
	| 'Подразделение' |
	
	| 'Имя'          | 'Значение'      |
	| 'text'         | 'Подразделение' |
	| 'color'        | 32768           |
	| 'transparency' | 127             |
	| 'duration'     | 1500            |
	| 'thickness'    | 6               |
	| 'frameDelay'   | 20              |
	
	И я нажимаю кнопку выбора у поля с именем 'Подразделение'
	Тогда открылось окно "Структура предприятия"
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование" | "Обособленный учет товаров" | "Статус"    |
		| "00-000012" | "Отдел продаж" | "Не ведется"                | "Действует" |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно "Заявка на расходование денежных средств (создание) *"
	И в поле с именем 'Заметки' я ввожу текст "Тестовый пример"
	И я перехожу к закладке с именем 'СтраницаРасшифровка'
	И я перехожу к закладке с именем 'СтраницаРаспределениеПоСчетам'
	И я перехожу к закладке с именем 'СтраницаОсновное'
	И я нажимаю на кнопку с именем 'ФормаЗаписать'

	И я запоминаю значение поля с именем 'Номер' как '$НомерЗаявкиНаРасходованиеДС$'

	Тогда открылось окно "Заявка на расходование ДС $НомерЗаявкиНаРасходованиеДС$ от *"
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И из выпадающего списка с именем 'Статус' я выбираю точное значение "К оплате"

	И я перехожу к закладке с именем 'СтраницаРасшифровка'
	
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
	| 'Имя/ID'     |
	| 'Статья ДДС' |
	
	| 'Имя'          | 'Значение'   |
	| 'text'         | 'Статья ДДС' |
	| 'color'        | 32768        |
	| 'transparency' | 127          |
	| 'duration'     | 1500         |
	| 'thickness'    | 6            |
	| 'frameDelay'   | 20           |

	И я нажимаю кнопку выбора у поля с именем 'РасшифровкаБезРазбиенияСтатьяДвиженияДенежныхСредств'
	Тогда открылось окно "Выбор статьи ДДС для операции \"Возврат или иная оплата клиенту\""
	И в таблице 'СписокПоХозяйственнойОперации' я перехожу на один уровень вниз

	Когда открылось окно "Выбор статьи ДДС для операции \"Возврат или иная оплата клиенту\""
	И в таблице 'СписокПоХозяйственнойОперации' я перехожу к строке:
		| "Статья ДДС"                                         |
		| "Возврат оплаты клиенту (продажа инвестиц. активов)" |
	И в таблице 'СписокПоХозяйственнойОперации' я нажимаю на кнопку с именем 'СписокПоХозяйственнойОперацииВыбрать'

* Запишем и проведём документ
	Тогда открылось окно "Заявка на расходование ДС $НомерЗаявкиНаРасходованиеДС$ от * *"
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	Тогда открылось окно "Заявка на расходование ДС $НомерЗаявкиНаРасходованиеДС$ от *"
	И Пауза 1
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И Пауза 1
* На основании проведённой заявки на рсходование денежных средств в статусе К оплате сформируем документ Списание безналичных денежных средств
* Для этого необходимо нажать на кнопку Создать на основании и выбрать документ Списание безналичных денежных средств

	И я нажимаю на кнопку с именем 'ПодменюСоздатьНаОснованииОбычное__Авто_A3B766C0AADEC4F519D06D8A1F3AACBC'
//	Когда открылось окно "1С:Предприятие"
//	И я нажимаю на кнопку с именем 'Button0'

	Тогда открылось окно "Списание безналичных денежных средств (создание)"

* В документе заполняем дату документа, отметку о проведении банком, банковский счет
	И в поле с именем 'НомерВходящегоДокумента' я ввожу текст "12"
	И я нажимаю кнопку выбора у поля с именем 'ДатаВходящегоДокумента'
	И в поле с именем 'ДатаВходящегоДокумента' я ввожу текст "28082026"
	И я изменяю флаг с именем 'ПроведеноБанком'
	И из выпадающего списка с именем 'БанковскийСчет' я выбираю точное значение "\"Райффайзенбанк\"(ЛИНКИ - руб.)"
	И в поле с именем 'НазначениеПлатежа' я ввожу текст "Тестовый пример"
	И я перехожу к закладке с именем 'СтраницаРасшифровка'

* Записываем и проводим документ
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	И я запоминаю значение поля с именем 'Номер' как '$СписаниеБезналичныхДС$'
	Тогда открылось окно "Списание безналичных ДС $СписаниеБезналичныхДС$ от *"
	И я нажимаю на кнопку с именем 'ФормаПровести'

* По окончании всей цепочки документов можно проставить статус Выполнено документа Заявка на возврат товаров от клиента
	И В панели открытых я выбираю "Заявка на возврат товаров от клиента $НомерЗаявкиНаВозврат$ от *"
	Тогда открылось окно "Заявка на возврат товаров от клиента $НомерЗаявкиНаВозврат$ от *"
	И из выпадающего списка с именем 'Статус' я выбираю точное значение "Выполнена"
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	Тогда открылось окно "Заявка на возврат товаров от клиента $НомерЗаявкиНаВозврат$ от *"

* Итак, мы провели всю цепочку документов по возврату товаров от клиента с последующим возвратом денежных средств
* Всю цепочку документов можно посмотреть в отчете Связанные документы
	И я нажимаю на кнопку с именем 'ПодменюОтчетыСмТакже__Авто_DFF4A1BC964F18C76E1B5EA04556DBE9'
* Ответсвенность по ролям пользователей в системе выглядит следующим образом
* Заявку на возврат товаров от клиента и заявку на расходование денежных средств формирует менеджер по продажам
* Возврат товаров от клиента и приходный ордер формируют сотрудники склада
* Списание безналичных денежных средств проводят сотрудники бухгалтерии
	И Пауза 1
* Мы познакомились с цепочкой документов по возврату товара от клиента с последующим возвратом денежных средств на реальном примере
* Поговорили о зоне ответственности каждой из пользовательских ролей в информационной системе
	И Пауза 1
* До новых встреч! С вами была Ванесса

//Когда открылось окно "1С:Предприятие"
//И я нажимаю на кнопку с именем 'Button0'

