#language: ru

@tree

Функционал: РБП

Как Аналитик 1С я хочу
подготивить фича файл со сквозным примером по РБП
чтобы подготовить видео0инструкцию   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Формирование документа Приобретение услуг и прочих активов с формирование РБП

//Формируем приобретение услуг и прочих активов
* Всем привет, с вами Ванэсса!
* И сегодня мы разберём вопрос, как отнести затраты на расходы будущих периодов
* В качестве примера мы приобретём услугу по использованию программного продукта и отнесём затраты на ЭР БЭ ПЭ на один календарный год
	И Пауза 1
* Для приобретения услуги оформим документ Приобретение услуг и прочих активов
* Данный документ можно сформировать в разделе Закупки
	И В командном интерфейсе я выбираю "Закупки" "Документы закупки (все)"
	Тогда открылось окно "Документы закупки (все)"
* Нажимаем на кнопку Создать и выбираем вид документа Приобретение услуг и прочих активов
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
		| 'Имя/ID'     | 'Тип'  |
		| 'Создать...' | 'Тип1' |
	
		| 'Имя'          | 'Значение'         |
		| 'text'         | 'Кнопка "Создать"' |
		| 'color'        | 32768              |
		| 'transparency' | 127                |
		| 'duration'     | 1000               |
		| 'thickness'    | 6                  |
		| 'frameDelay'   | 20                 |
	И Пауза 1	
	И в таблице 'СписокДокументыЗакупки' я нажимаю на кнопку с именем 'Создать_ДокументЧерезФормуВыбора'
	Тогда открылось окно "Создание документа по хозяйственной операции"
	И в таблице 'ДеревоПоДокументам' я перехожу к строке:
		| "Представление"                       |
		| "Приобретение услуг и прочих активов" |
	И я нажимаю на кнопку с именем 'ФормаВыбратьСоздать'
	Тогда открылось окно "Приобретение услуг и прочих активов (создание)"
* на вкладке Основное заполняем организацию и поставщика
	И из выпадающего списка с именем 'Организация' я выбираю точное значение "КОМПТЕК (новая фирма)"
	И я нажимаю кнопку выбора у поля с именем 'Партнер'
	Тогда открылось окно "Партнеры (Поставщики)"
	И в таблице 'Список' я активизирую дополнение формы с именем 'СтрокаПоискаСписок'
	И в таблице 'Список' в дополнение формы с именем 'СтрокаПоискаСписок' я ввожу текст "СКБ Контур"
	И в таблице 'Список' я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно "Приобретение услуг и прочих активов (создание) *"
	И я перехожу к закладке с именем 'ГруппаРасходы'
* на вкладке Расходы и прочие активы заполняем данные по расходам, статье и аналитике	
	И в таблице 'Расходы' я нажимаю на кнопку с именем 'РасходыДобавить'
	И в таблице 'Расходы' в поле с именем 'РасходыСодержание' я ввожу текст "Право использования программы для ЭВМ \"Контур.Диадок\" Плагин \"Логистика.Базовый\""
	//И в таблице 'Расходы' я активизирую поле с именем 'РасходыЦена'
	//И в таблице 'Расходы' в поле с именем 'РасходыЦена' я ввожу текст "1,00"
	//И в таблице 'Расходы' я активизирую поле с именем 'РасходыСумма'
	И в таблице 'Расходы' я активизирую поле с именем 'РасходыКоличество'
	И в таблице 'Расходы' в поле с именем 'РасходыКоличество' я ввожу текст "1,000"
	И в таблице 'Расходы' я активизирую поле с именем 'РасходыЦена'
	И в таблице 'Расходы' в поле с именем 'РасходыЦена' я ввожу текст "8 891,67"
	И в таблице 'Расходы' я активизирую поле с именем 'РасходыСтавкаНДС'
	И в таблице 'Расходы' из выпадающего списка с именем 'РасходыСтавкаНДС' я выбираю точное значение "Без НДС"
	И я перехожу к следующему реквизиту
* Подразделение и статью выбираем из справочников	
	И в таблице 'Расходы' я нажимаю кнопку выбора у реквизита с именем 'РасходыПодразделение'
	Тогда открылось окно "Структура предприятия"
	И в таблице 'Список' я перехожу к строке:
		| "Код"       | "Наименование"           | "Статус"    |
		| "00-000016" | "Основное подразделение" | "Действует" |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно "Приобретение услуг и прочих активов (создание) *"
	И в таблице 'Расходы' я активизирую поле с именем 'РасходыСтатьяРасходов'
	И в таблице 'Расходы' я нажимаю кнопку выбора у реквизита с именем 'РасходыСтатьяРасходов'
	Тогда открылось окно "Выбор статьи"
	И в таблице 'СтатьиРасходов' я перехожу к строке:
		| "Аналитика"      | "Код"       | "Наименование"                          | "Описание"                           |
		| "Прочие расходы" | "00-000086" | "РБП: Лицензии на ПО и ЭЦП (сч. 97.21)" | "Счет распределения помесячно - 44 " |
	И в таблице 'СтатьиРасходов' я активизирую поле с именем 'СтатьиРасходовНаименование'
	И в таблице 'СтатьиРасходов' я нажимаю на кнопку с именем 'СтатьиРасходовКнопкаВыбрать'
	Тогда открылось окно "Приобретение услуг и прочих активов (создание) *"
	И в таблице 'Расходы' я завершаю редактирование строки
* По документам поставщика создадим новую аналитику и подставим в наш документ приобретения
	И в таблице 'Расходы' я активизирую поле с именем 'РасходыАналитикаРасходов'
	И в таблице 'Расходы' я выбираю текущую строку
	И в таблице 'Расходы' я нажимаю кнопку выбора у реквизита с именем 'РасходыАналитикаРасходов'
	Тогда открылось окно "Прочие расходы"

	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно "Прочие расходы (создание)"
	И в поле с именем 'Наименование' я ввожу текст "Право использования программы для ЭВМ «Контур.Диадок» Плагин «Логистика.Базовый »"
	И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
	
	И в таблице 'Список' я перехожу к строке:
		| "Наименование"                                                                     |
		| "Право использования программы для ЭВМ «Контур.Диадок» Плагин «Логистика.Базовый»" |
	И я нажимаю на кнопку с именем 'ФормаВыбрать'
	Тогда открылось окно "Приобретение услуг и прочих активов (создание) *"
	И в таблице 'Расходы' я завершаю редактирование строки
* Проводим и сохраняем документ
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	//Тогда открылось окно "Приобретение услуг и прочих активов * от *"
	И я нажимаю на кнопку с именем 'ФормаПровести'
* При необходимости можно зарегистрировать счёт-фактуру. Это можно сделать при переходе по гипер ссылке в левом нижнем углу экрана
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	//И я жду закрытия окна "Приобретение услуг и прочих активов * от *" в течение 20 секунд

	//Распределение РБП
* Рабочее место по распределению ЭР БЭ ПЭ можно найти в разделе Финансовый результат и контроллинг подраздел Доходы и расходы, финансовый результат
	И В командном интерфейсе я выбираю "Финансовый результат и контроллинг" "Распределение РБП"
	Тогда открылось окно "Распределение расходов будущих периодов"
* Поставим фильтр по Организации
	Когда открылось окно "Распределение расходов будущих периодов"
	И из выпадающего списка с именем 'Организация' я выбираю точное значение "КОМПТЕК (новая фирма)"
* Перейдём к статье, заведённой в предыдущем документе на нажмём на кнопку Распределить расходы
	И в таблице 'РасходыКРаспределению' я перехожу к строке:
		| "Аналитика РБП"                                                                    | "Без НДС"  | "БУ"       | "Организация"           | "Подразделение"          | "С НДС"    | "Статья РБП"                            |
		| "Право использования программы для ЭВМ «Контур.Диадок» Плагин «Логистика.Базовый»" | "8 891,67" | "8 891,67" | "КОМПТЕК (новая фирма)" | "Основное подразделение" | "8 891,67" | "РБП: Лицензии на ПО и ЭЦП (сч. 97.21)" |
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
		| 'Имя/ID'               | 'Тип'  |
		| 'Распределить расходы' | 'Тип1' |
	
		| 'Имя'          | 'Значение'                      |
		| 'text'         | 'Кнопка "Распределить расходы"' |
		| 'color'        | 32768                           |
		| 'transparency' | 127                             |
		| 'duration'     | 1000                            |
		| 'thickness'    | 6                               |
		| 'frameDelay'   | 20                              |
	И Пауза 1
	И в таблице 'РасходыКРаспределению' я нажимаю на кнопку с именем 'РасходыКРаспределениюСоздатьРаспределениеРасходов'
	Тогда открылось окно "Распределение расходов будущих периодов (создание)"
* Укажем период распределения. В нашем примере это 12 месяцев
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
		| 'Имя/ID' | 'Тип'  |
		| 'на'     | 'Тип1' |
	
		| 'Имя'          | 'Значение'             |
		| 'text'         | 'Период распределения' |
		| 'color'        | 32768                  |
		| 'transparency' | 127                    |
		| 'duration'     | 1000                   |
		| 'thickness'    | 6                      |
		| 'frameDelay'   | 20                     |
	И Пауза 1
	И я перехожу к закладке с именем 'СтраницаРаспределение'
* Для автоматического распределения затрат необходимо нажать на кнопку Распределить расходы
	И я делаю эффект затемнения у элементов формы UI Automation "Торговля (КОПИЯ)"
		| 'Имя/ID'               | 'Тип'  |
		| 'Распределить расходы' | 'Тип1' |
	
		| 'Имя'          | 'Значение'             |
		| 'text'         | 'Распределить расходы' |
		| 'color'        | 32768                  |
		| 'transparency' | 127                    |
		| 'duration'     | 1000                   |
		| 'thickness'    | 6                      |
		| 'frameDelay'   | 20                     |
	И Пауза 1
	И в таблице 'РаспределениеРасходов' я нажимаю на кнопку с именем 'РаспределениеРасходовЗаполнитьРаспределение'
	И я перехожу к закладке с именем 'СтраницаОсновное'
* Сохраняем и проводим документ
	И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
	И Пауза 1
* Итак, мы с вами рассмотрели сквозной пример отнесения затрат на расходы будущих периодов 	
* До новых встреч, с вами была Ванэсса!


